In [1]:
#used in data wrangling 
import pandas as pd
import numpy as np

In [3]:
first_series = pd.Series(list('AbGGHJ123hjhj'))
first_series

0     A
1     b
2     G
3     G
4     H
5     J
6     1
7     2
8     3
9     h
10    j
11    h
12    j
dtype: object

In [5]:
# to notice how indexing is done automatically, with data types and objects given
np_country = np.array(['Algeria', 'Angola', 'Argentina', 'Australia', 'Austria'])
s_country = pd.Series(np_country)
print (s_country)

0      Algeria
1       Angola
2    Argentina
3    Australia
4      Austria
dtype: object

In [17]:
# to keep our own index. note index always comes first 
gdp_dict_country = pd.Series(['2255.225482', '629.9553062', '11601.63022', '25306.82494',
        '27266.40335', '19466.99052', '588.3691778', '2890.345675',
        '24733.62696', '1445.760002', '4803.398244', '2618.876037',
        '590.4521124', '665.7982328', '7122.938458', '2639.54156',
        '3362.4656', '15378.16704'],
        index =['Algeria', 'Angola', 'Argentina', 'Australia', 'Austria',
        'Bahamas', 'Bangladesh', 'Belarus', 'Belgium', 'Bhutan',
        'Brazil', 'Bulgaria', 'Cambodia', 'Cameroon', 'Chile', 'China',
        'Colombia', 'Cyprus'])
print ( gdp_dict_country)

Algeria       2255.225482
Angola        629.9553062
Argentina     11601.63022
Australia     25306.82494
Austria       27266.40335
Bahamas       19466.99052
Bangladesh    588.3691778
Belarus       2890.345675
Belgium       24733.62696
Bhutan        1445.760002
Brazil        4803.398244
Bulgaria      2618.876037
Cambodia      590.4521124
Cameroon      665.7982328
Chile         7122.938458
China          2639.54156
Colombia        3362.4656
Cyprus        15378.16704
dtype: object

In [15]:
#scalar as index, index is always a collection of some kind 
scalar_series = pd.Series(10, np.array(['a','b','c','d','e']))
scalar_series

a    10
b    10
c    10
d    10
e    10
dtype: int64

In [18]:
#access of elements in the series 
gdp_dict_country[0]

C:\Users\ramasastrydatta\AppData\Local\Temp\ipykernel_7620\1507494966.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  gdp_dict_country[0]

'2255.225482'

In [26]:
#access first five countries in series 
gdp_dict_country[0:6]

Algeria      2255.225482
Angola       629.9553062
Argentina    11601.63022
Australia    25306.82494
Austria      27266.40335
Bahamas      19466.99052
dtype: object

In [23]:
# look up by name is .loc
gdp_dict_country.loc['Bangladesh']

'588.3691778'

In [28]:
#since bangladesh has index '6' entering either input in argument will give same output, but its loc and iloc respectively.
gdp_dict_country.iloc[6]

'588.3691778'

In [30]:
series_one = pd.Series([1,2,3,4],index =['a','b','c','d'])
series_two = pd.Series([10,20,30,40],index=['a','b','c','d'])
series_one+series_two

a    11
b    22
c    33
d    44
dtype: int64

In [31]:
#boud to the index 
series_two = pd.Series([10,20,30,40],index=['a','c','b','d'])
series_one+series_two

a    11
b    32
c    23
d    44
dtype: int64

In [32]:
series_two = pd.Series([10,20,30,40],index=['a','c','e','f'])
series_one+series_two

a    11.0
b     NaN
c    23.0
d     NaN
e     NaN
f     NaN
dtype: float64

In [33]:
# challenges faced due to NaN values.
import pandas as pd

In [34]:
icc_winner_list ={'Year':[2011,2015,2019,2023],'Winners':['India','Australia','England','Australia'],'Venue':['India','Australia','England','India']}

In [37]:
df_icc_winner = pd.DataFrame(icc_winner_list)
df_icc_winner

   Year    Winners      Venue
0  2011      India      India
1  2015  Australia  Australia
2  2019    England    England
3  2023  Australia      India

In [38]:
icc_winner_dict = {2011:{'India':'India'},2023:{'India':'Australia'}}
df_icc_winner_dict = pd.DataFrame(icc_winner_dict)
df_icc_winner_dict

        2011       2023
India  India  Australia

In [45]:
#viewing the columns 
df_icc_winner.Year

0    2011
1    2015
2    2019
3    2023
Name: Year, dtype: int64

In [46]:
#describe to see all content
df_icc_winner.describe

<bound method NDFrame.describe of    Year    Winners      Venue
0  2011      India      India
1  2015  Australia  Australia
2  2019    England    England
3  2023  Australia      India>

In [48]:
#create dataframe from dict of series
winner_series = pd.Series(['India','Australia','England','Australia'],index = [2011,2015,2019,2023])
Venue_series = pd.Series(['India','Australia','England','India'],index = [2011,2015,2019,2023])
df_winner = pd.DataFrame({'Winners':winner_series,'Venue':Venue_series})
df_winner

        Winners      Venue
2011      India      India
2015  Australia  Australia
2019    England    England
2023  Australia      India

In [49]:
#creating dataframe with dict of ndarray
import numpy as np

In [50]:
np_array = np.array([2011,2015,2019,2023])
dict_ndarray = {'Year':np_array}
df_ndarray=pd.DataFrame(dict_ndarray)
df_ndarray

   Year
0  2011
1  2015
2  2019
3  2023

In [53]:
#dataframe from a dataframe 
df_from_df = pd.DataFrame(df_winner)
df_from_df

        Winners      Venue
2011      India      India
2015  Australia  Australia
2019    England    England
2023  Australia      India

In [54]:
# View and select data 
import numpy as np
import pandas as pd

In [55]:
winner_series = pd.Series(['India','Australia','England','Australia'],index = [2011,2015,2019,2023])
Venue_series = pd.Series(['India','Australia','England','India'],index = [2011,2015,2019,2023])
df_winner = pd.DataFrame({'Winners':winner_series,'Venue':Venue_series})
df_winner

        Winners      Venue
2011      India      India
2015  Australia  Australia
2019    England    England
2023  Australia      India

In [56]:
df_winner.describe

<bound method NDFrame.describe of         Winners      Venue
2011      India      India
2015  Australia  Australia
2019    England    England
2023  Australia      India>

In [57]:
# view from top
df_winner.head(2)

        Winners      Venue
2011      India      India
2015  Australia  Australia

In [61]:
#view from down
df_winner.tail(2)

        Winners    Venue
2019    England  England
2023  Australia    India

In [62]:
# to view index
df_winner.index

Index([2011, 2015, 2019, 2023], dtype='int64')

In [63]:
# to view columns 
df_winner.columns

Index(['Winners', 'Venue'], dtype='object')

In [64]:
#select data 
df_winner['Venue']

2011        India
2015    Australia
2019      England
2023        India
Name: Venue, dtype: object

In [65]:
df_winner['Winners']

2011        India
2015    Australia
2019      England
2023    Australia
Name: Winners, dtype: object

In [66]:
# select based on location using labels
df_winner.loc[2019]

Winners    England
Venue      England
Name: 2019, dtype: object

In [67]:
#select using index position
df_winner.iloc[0:3]

        Winners      Venue
2011      India      India
2015  Australia  Australia
2019    England    England

In [71]:
#select based on index value
df_winner.iat[2,1]

'England'

In [77]:
#select data by condition which is number of times Australia won the world cup
df_winner [df_winner['Winners' ='Australia']]

SyntaxError: cannot assign to literal here. Maybe you meant '==' instead of '='? (1717082722.py, line 2)

In [80]:
#missing values NaN : Not a Number 
series_one = pd.Series([1,2,3,4,5],index =['a','b','c','d','e'])
series_two = pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])
sum_of_series = series_one+series_two
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [85]:
#dropna function
dropna_s=sum_of_series.dropna()
dropna_s

c    13.0
e    25.0
dtype: float64

In [91]:
#fill NaN
fillna_s = sum_of_series.fillna(0)
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [93]:
#3 fill NaN with 0 before operation
fill_NaN_with_zero_before_sum = series_one.add(series_two,fill_value=0)
fill_NaN_with_zero_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [95]:
#DATA OPERATIONS
df_movie_rating = pd.DataFrame({'movie 1':[5,4,3,3,2,1],'movie 2' :[4,5,2,3,4,2]},index =['Tom','Ram','Ken','Tsu','Gus','Dre'])
df_movie_rating

     movie 1  movie 2
Tom        5        4
Ram        4        5
Ken        3        2
Tsu        3        3
Gus        2        4
Dre        1        2

In [109]:
def movie_grade(rating):
    if rating = 5:
        return 'A'
    if rating = 4:
        return 'B'
    if rating = 3:
        return 'C'
    else :
        return 'F'

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (500076109.py, line 2)

In [111]:
print (movie_grade(4))

B

In [112]:
#applymap method
df_movie_rating.applymap(movie_grade)

C:\Users\ramasastrydatta\AppData\Local\Temp\ipykernel_7620\3508546455.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_movie_rating.applymap(movie_grade)

    movie 1 movie 2
Tom       A       B
Ram       B       A
Ken       C       F
Tsu       C       C
Gus       F       B
Dre       F       F

In [113]:
#use of STATS
df_test_scores = pd.DataFrame({'Test1' : [23,34,45,49,41,39],'Test2' : [44,40,49,49,46,43]},index = ['Ram','Shyam','Kris','Shiv','Indr','Ayan'])
df_test_scores

       Test1  Test2
Ram       23     44
Shyam     34     40
Kris      45     49
Shiv      49     49
Indr      41     46
Ayan      39     43

In [114]:
df_test_scores.max()

Test1    49
Test2    49
dtype: int64

In [115]:
df_test_scores.mean()

Test1    38.500000
Test2    45.166667
dtype: float64

In [116]:
df_test_scores.std()

Test1    9.159694
Test2    3.544949
dtype: float64

In [117]:
#use of GROUPBY
df_movie_rating = pd.DataFrame({'movie 1':[5,4,3,3,2,1],'movie 2' :[4,5,2,3,4,2]},index =['Tom','Ram','Ken','Tsu','Gus','Dre'])
df_movie_rating

     movie 1  movie 2
Tom        5        4
Ram        4        5
Ken        3        2
Tsu        3        3
Gus        2        4
Dre        1        2

In [120]:
grouped = df_movie_rating.groupby('movie 1')
grp_data = grouped.get_group(3)
grp_data

     movie 1  movie 2
Ken        3        2
Tsu        3        3

In [121]:
#sorting 
df_movie_rating.sort_values('movie 1')

     movie 1  movie 2
Dre        1        2
Gus        2        4
Ken        3        2
Tsu        3        3
Ram        4        5
Tom        5        4

In [122]:
#standardize datasets
def standardize_tests(test):
    return (test-test.mean())/test.std()

In [124]:
standardize_tests(df_test_scores['Test1'])

Ram     -1.692196
Shyam   -0.491283
Kris     0.709631
Shiv     1.146326
Indr     0.272935
Ayan     0.054587
Name: Test1, dtype: float64

In [126]:
# for both tests : applying the function to the entire dataset 
import numpy as np
import pandas as pd
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [127]:
standardize_test_scores(df_test_scores)

          Test1     Test2
Ram   -1.692196 -0.329107
Shyam -0.491283 -1.457473
Kris   0.709631  1.081351
Shiv   1.146326  1.081351
Indr   0.272935  0.235076
Ayan   0.054587 -0.611198

In [128]:
# DATA OPERATIONS ; MERGE, DUPLICATE & CONCATENATE
# IMPORT PANDAS
import pandas as pd

In [129]:
#define student data frome with math data 
df_student_math =pd.DataFrame ({'student':['Tom','Ram','Ken','Tsu','Gus','Dre'], 'ID':[10,56,31,85,9,22] })

In [130]:
#science data set 
df_student_science = pd.DataFrame({'student':['Tom','Tsu','Dre'], 'ID':[10,12,22] })

In [132]:
#merge the dataframes to give a single dataframe 
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1     Dre  22

In [133]:
#merge with key on student : returns common students
pd.merge(df_student_math,df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Tsu    85    12
2     Dre    22    22

In [5]:
#merge on key values and also fill X in spaces of NaN
import pandas as pd
df_student_math =pd.DataFrame ({'student':['Tom','Ram','Ken','Tsu','Gus','Dre'], 'ID':[10,56,31,85,9,22] })
df_student_science = pd.DataFrame({'student':['Tom','Tsu','Dre'], 'ID':[10,12,22] })

pd.merge(df_student_math,df_student_science,how='left', on='ID').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1       Ram  56         X
2       Ken  31         X
3       Tsu  85         X
4       Gus   9         X
5       Dre  22       Dre

In [16]:
#concatenate dataframes
pd.concat([df_student_math,df_student_science],ignore_index = True)

  student  ID
0     Tom  10
1     Ram  56
2     Ken  31
3     Tsu  85
4     Gus   9
5     Dre  22
6     Tom  10
7     Tsu  12
8     Dre  22

In [8]:
#new dataframe 
df_new_survey =pd.DataFrame ({'student':['Tom','Ram','Ken','Tom','Ken','Dre'], 'ID':[10,56,31,10,31,22] })
df_new_survey

  student  ID
0     Tom  10
1     Ram  56
2     Ken  31
3     Tom  10
4     Ken  31
5     Dre  22

In [9]:
#check for duplicate value, true for duplicated & false for not duplicated
df_new_survey.duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [10]:
#drop duplicate values with student as key
df_new_survey.drop_duplicates('student')

  student  ID
0     Tom  10
1     Ram  56
2     Ken  31
5     Dre  22

In [18]:
#drop duplicate elements with id as key
df_new_survey.drop_duplicates('ID')

  student  ID
0     Tom  10
1     Ram  56
2     Ken  31
5     Dre  22